<?php
		if($_SERVER["REQUEST_METHOD"] == "POST"){
			if(empty($_POST["height"]) or empty($_POST["weight"])){
				$result = "";
			}
			else{
				$weight = $_POST["weight"];
				$height = $_POST["height"];
				$result = $weight / (($height / 100) ** 2);

				if($result >= 40){
					$data = " <b>โรคอ้วนขั้นสูงสุด</b>";
				}
				else if($result > 35.0 && $result < 39.9){
					$data = " <b>โรคอ้วนระดับ2</b> คุณเสี่ยงต่อการเกิดโรคที่มากับความอ้วน หากคุณมีเส้นรอบเอวมากกว่าเกณฑ์ปกติคุณจะเสี่ยงต่อการเกิดโรคสูง คุณต้องควบคุมอาหาร และออกกำลังกายอย่างจริงจัง";
				}
				else if($result > 28.5 && $result < 34.9){
					$data = " <b>โรคอ้วนระดับ1</b> และหากคุณมีเส้นรอบเอวมากกว่า 90 ซม.(ชาย) 80 ซม.(หญิง) คุณจะมีโอกาศเกิดโรคความดัน เบาหวานสูง จำเป็นต้องควบคุมอาหาร และออกกำลังกาย";
				}
				else if($result > 23.5 && $result < 28.4){
					$data = " <b>น้ำหนักเกิน</b> หากคุณมีกรรมพันธ์เป็นโรคเบาหวานหรือไขมันในเลือดสูงต้องพยายามลดน้ำหนักให้ดัชนีมวลกายต่ำกว่า 23";
				}
				else if($result > 18.5 && $result < 23.4){
					$data = " <b>น้ำหนักปกติ</b> และมีปริมาณไขมันอยู่ในเกณฑ์ปกติ มักจะไม่ค่อยมีโรคร้าย อุบัติการณ์ของโรคเบาหวาน ความดันโลหิตสูงต่ำกว่าผู้ที่อ้วนกว่านี้";
				}
				else if($result < 18.5){
					$data = " <b>น้ำหนักน้อยเกินไป</b> ซึ่งอาจจะเกิดจากนักกีฬาที่ออกกำลังกายมาก และได้รับสารอาหารไม่เพียงพอ วิธีแก้ไขต้องรับประทานอาหารที่มีคุณภาพ และมีปริมาณพลังงานเพียงพอ และออกกำลังกายอย่างเหมาะสม";
				}
			}

			$resultShow = "ดัชนีมวลกายของคุณ = ". $result. "<br><br>". $data;

  		echo "<div style='text-align: center;  padding: 50px; font-size: 20px;'>";
			echo "<div style='border: solid 5px yellow; padding: 20px;'>";
			echo "<b>ผลลัพธ์คำนวณดัชนีมวลกาย Body Mass Index (BMI)</b>";
			echo "</div>";

			echo "<br><br>";
			echo $resultShow;
			echo "</div>";
		}
	?>
